org/python3_cookbook.org
#+TITLE: Python3 CookBook Learning

*** 数据结构和算法
    Python 提供了大量的内置数据结构，包括列表、集合和字典。这里将讨论使用这些数据结构遇到的查询、排序和过滤等问题，并在集合模块 collections 当中操作菏泽写数据结构的方法。
**** 解压序列赋值给多个变量
     如何将一个包含 N 个元素的元组或序列解压赋值给 N 个变量？
     #+BEGIN_SRC python :exports both :results output
       p = (4, 5)
       x, y = p
       print(x, y)

       data = ['ACEM', 50, 91.1, (2012, 12, 21)]
       name, shares, price, date = data
       print(name, shares, price, date)

       name, shares, price, (year, mon, day) = data
       print(name, shares, price, year, mon, day)
     #+END_SRC

     #+RESULTS:
     : 4 5
     : ACEM 50 91.1 (2012, 12, 21)
     : ACEM 50 91.1 2012 12 21
    这种解压赋值可以用在任何可迭代对象上面，而不仅仅是列表或元组。包括字符串，文件对象，迭代器和生成器。
    #+BEGIN_SRC python :exports both :results output
      a, b, c, d, e = 'Hello'
      print(a, b, c, d, e)
      a, b, c, d = range(4)
      print(a, b, c, d)
    #+END_SRC

    #+RESULTS:
    : H e l l o
    : 0 1 2 3
    如果只需要部分值，可用任意不被用到的变量名去占位。

**** 解压可迭代对象赋值给多个变量
     如果一个可迭代对象的元素个数超过变量个数，会抛出一个 ValueError。则如何从这个可迭代对象中解压出 N 个元素呢？
     python 的星号表达式可以解决这个问题。
     #+BEGIN_SRC python :exports both :results output
       a, b, *c = [1, 2, 3, 4, 5]
       print(a, b, c)

       a, b, *c = range(10)
       print(a, b, c)

       a, *b, c = range(10)
       print(a, b, c)

       ,*a, b, c = range(10)
       print(a, b, c, end='')
     #+END_SRC

     #+RESULTS:
     : 1 2 [3, 4, 5]
     : 0 1 [2, 3, 4, 5, 6, 7, 8, 9]
     : 0 [1, 2, 3, 4, 5, 6, 7, 8] 9
     : [0, 1, 2, 3, 4, 5, 6, 7] 8 9
     注意：星号对应的变量永远是列表类型。
     扩展的迭代解压语法是专门为解压不确定个数或任意个数元素的可迭代对象而设计的。通常这些可迭代对象的元素结构有确定的规则，特别是，星号表达式在迭代元素为可变长元组的序列时是很有用的。
     #+BEGIN_SRC python :exports both :results output
       records = [('foo', 1, 2), ('bar', 'hello'), ('foo', 3, 4)]


       def do_foo(x, y):
           print('foo', x, y)


       def do_bar(s):
           print('bar', s)


       for tag, *args in records:
           if tag == 'foo':
               do_foo(*args)
           elif tag == 'bar':
               do_bar(*args)
     #+END_SRC

     #+RESULTS:
     : foo 1 2
     : bar hello
     : foo 3 4
     
     星号解压语法在字符串操作的时候也会很有用，比如分割字符串：
     #+BEGIN_SRC python :exports both :results output
       line = 'nobody:*:-2:-2:Unprivileged User:/var/empty:/usr/bin/false'
       uname, *fields, homedir, sh = line.split(':')
       print(uname, fields, homedir, sh)
     #+END_SRC

     #+RESULTS:
     : nobody ['*', '-2', '-2', 'Unprivileged User'] /var/empty /usr/bin/false

