python3_cookbook.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-14 四 18:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python3 CookBook</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" title="Standard" href="/worg/style/worg.css" type="text/css" />
<link rel="alternate stylesheet" title="Zenburn" href="/worg/style/worg-zenburn.css" type="text/css" />
<link rel="alternate stylesheet" title="Classic" href="/worg/style/worg-classic.css" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Python3 CookBook</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd796a51">数据结构和算法</a>
<ul>
<li><a href="#org5bae49a">解压序列赋值给多个变量</a></li>
<li><a href="#org050c4f4">解压可迭代对象赋值给多个变量</a></li>
<li><a href="#orgf1492d8">保留组后 N 个元素</a></li>
<li><a href="#orga3f30cb">查找最大或最小的 N 个元素</a></li>
<li><a href="#org209ca5a">实现一个优先级队列</a></li>
</ul>
</li>
<li><a href="#org900e24c">字符串和文本</a></li>
<li><a href="#org984de2b">数字日期和时间</a></li>
<li><a href="#orgef8a60d">迭代器与生成器</a></li>
<li><a href="#orge222deb">文本与 IO</a></li>
<li><a href="#org3dc8150">数据编码和处理</a></li>
<li><a href="#org0b6d568">函数</a></li>
<li><a href="#org5377ac1">类与对象</a></li>
<li><a href="#orgb2c42f9">元编程</a></li>
<li><a href="#org013f137">模块与包</a></li>
<li><a href="#org15592bd">网络与 web 编程</a></li>
<li><a href="#org6f1a438">并发编程</a></li>
<li><a href="#org7f086ae">脚本编程与系统管理</a></li>
<li><a href="#org59d38d5">测试、调试和异常</a></li>
<li><a href="#orgcaff163">C 语言扩展</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd796a51" class="outline-2">
<h2 id="orgd796a51">数据结构和算法</h2>
<div class="outline-text-2" id="text-orgd796a51">
<p>
Python 提供了大量的内置数据结构，包括列表、集合和字典。这里将讨论使用这些数据结构遇到的查询、排序和过滤等问题，并在集合模块 collections 当中操作菏泽写数据结构的方法。
</p>
</div>
<div id="outline-container-org5bae49a" class="outline-3">
<h3 id="org5bae49a">解压序列赋值给多个变量</h3>
<div class="outline-text-3" id="text-org5bae49a">
<p>
如何将一个包含 N 个元素的元组或序列解压赋值给 N 个变量？
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">p</span> = <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">x</span>, <span style="color: #7590db;">y</span> = p
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>x, y<span style="color: #4f97d7;">)</span>

<span style="color: #7590db;">data</span> = <span style="color: #4f97d7;">[</span><span style="color: #2d9574;">'ACEM'</span>, <span style="color: #a45bad;">50</span>, <span style="color: #a45bad;">91</span>.<span style="color: #a45bad;">1</span>, <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2012</span>, <span style="color: #a45bad;">12</span>, <span style="color: #a45bad;">21</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">]</span>
<span style="color: #7590db;">name</span>, <span style="color: #7590db;">shares</span>, <span style="color: #7590db;">price</span>, <span style="color: #7590db;">date</span> = data
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>name, shares, price, date<span style="color: #4f97d7;">)</span>

name, shares, price, <span style="color: #4f97d7;">(</span>year, mon, day<span style="color: #4f97d7;">)</span> = data
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>name, shares, price, year, mon, day<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
4 5
ACEM 50 91.1 (2012, 12, 21)
ACEM 50 91.1 2012 12 21

</pre>
<p>
这种解压赋值可以用在任何可迭代对象上面，而不仅仅是列表或元组。包括字符串，文件对象，迭代器和生成器。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span>, <span style="color: #7590db;">c</span>, <span style="color: #7590db;">d</span>, <span style="color: #7590db;">e</span> = <span style="color: #2d9574;">'Hello'</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>a, b, c, d, e<span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span>, <span style="color: #7590db;">c</span>, <span style="color: #7590db;">d</span> = <span style="color: #4f97d7;">range</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">4</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>a, b, c, d<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
H e l l o
0 1 2 3

</pre>
<p>
如果只需要部分值，可用任意不被用到的变量名去占位。
</p>
</div>
</div>

<div id="outline-container-org050c4f4" class="outline-3">
<h3 id="org050c4f4">解压可迭代对象赋值给多个变量</h3>
<div class="outline-text-3" id="text-org050c4f4">
<p>
如果一个可迭代对象的元素个数超过变量个数，会抛出一个 ValueError。则如何从这个可迭代对象中解压出 N 个元素呢？
python 的星号表达式可以解决这个问题。
</p>
<div class="org-src-container">
<pre class="src src-python">a, b, *<span style="color: #7590db;">c</span> = <span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span><span style="color: #4f97d7;">]</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>a, b, c<span style="color: #4f97d7;">)</span>

a, b, *<span style="color: #7590db;">c</span> = <span style="color: #4f97d7;">range</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">10</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>a, b, c<span style="color: #4f97d7;">)</span>

a, *<span style="color: #7590db;">b</span>, <span style="color: #7590db;">c</span> = <span style="color: #4f97d7;">range</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">10</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>a, b, c<span style="color: #4f97d7;">)</span>

*<span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span>, <span style="color: #7590db;">c</span> = <span style="color: #4f97d7;">range</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">10</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>a, b, c, end=<span style="color: #2d9574;">''</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
1 2 [3, 4, 5]
0 1 [2, 3, 4, 5, 6, 7, 8, 9]
0 [1, 2, 3, 4, 5, 6, 7, 8] 9
[0, 1, 2, 3, 4, 5, 6, 7] 8 9

</pre>
<p>
注意：星号对应的变量永远是列表类型。扩展的迭代解压语法是专门为解压不确定个数或任意个数元素的可迭代对象而设 concat 计的。通常这些可迭代对象的元素结构有确定的规则，特别是，星号表达式在迭代元素为可变长元组的序列时是很有用的。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">records</span> = <span style="color: #4f97d7;">[</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'foo'</span>, <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>, <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'bar'</span>, <span style="color: #2d9574;">'hello'</span><span style="color: #bc6ec5;">)</span>, <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'foo'</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">]</span>


<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">do_foo</span><span style="color: #4f97d7;">(</span>x, y<span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'foo'</span>, x, y<span style="color: #4f97d7;">)</span>


<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">do_bar</span><span style="color: #4f97d7;">(</span>s<span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'bar'</span>, s<span style="color: #4f97d7;">)</span>


<span style="color: #4f97d7; font-weight: bold;">for</span> tag, *args <span style="color: #4f97d7; font-weight: bold;">in</span> records:
    <span style="color: #4f97d7; font-weight: bold;">if</span> tag == <span style="color: #2d9574;">'foo'</span>:
        do_foo<span style="color: #4f97d7;">(</span>*args<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">elif</span> tag == <span style="color: #2d9574;">'bar'</span>:
        do_bar<span style="color: #4f97d7;">(</span>*args<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
foo 1 2
bar hello
foo 3 4

</pre>

<p>
星号解压语法在字符串操作的时候也会很有用，比如分割字符串：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">line</span> = <span style="color: #2d9574;">'nobody:*:-2:-2:Unprivileged User:/var/empty:/usr/bin/false'</span>
uname, *<span style="color: #7590db;">fields</span>, <span style="color: #7590db;">homedir</span>, <span style="color: #7590db;">sh</span> = line.split<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">':'</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>uname, fields, homedir, sh<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
nobody ['*', '-2', '-2', 'Unprivileged User'] /var/empty /usr/bin/false

</pre>
</div>
</div>
