org/python3_cookbook.org
**** 保留组后 N 个元素
     在迭代操作或者其他操作时，怎样只保留最后有限几个元素的历史记录？
     保留有限历史记录正是 collections.deque 大显身手的时候。
     #+BEGIN_SRC python :exports both :results output
       from collections import deque


       file_lines = '''Python is powerful... and fast;
       plays well with others;
       runs everywhere;
       is friendly & easy to learn;
       is Open.
       These are some of the reasons people who use Python would rather not use anything else.

       Python can be easy to pick up whether you're a first time programmer
       or you're experienced with other languages.
       The following pages are a useful first step to get on your way
       writing programs with Python!

       The community hosts conferences and meetups, collaborates on code,
       and much more. Python's documentation will help you along the way,
       and the mailing lists will keep you in touch.

       Conferences and Workshops
       Python Documentation
       Mailing Lists and IRC channels'''


       def search(lines, pattern, history=5):
           previous_lines = deque(maxlen=history)
           for line in lines:
               if pattern in line:
                   yield line, previous_lines
               previous_lines.append(line)


       for line, prevlines in search(file_lines.split('\n'), 'Python', 5):
           for pline in prevlines:
               print(pline)
           print(line)
           print('-' * 15)
     #+END_SRC

     #+RESULTS:
     #+begin_example
     Python is powerful... and fast;
     ---------------
     Python is powerful... and fast;
     plays well with others;
     runs everywhere;
     is friendly & easy to learn;
     is Open.
     These are some of the reasons people who use Python would rather not use anything else.
     ---------------
     runs everywhere;
     is friendly & easy to learn;
     is Open.
     These are some of the reasons people who use Python would rather not use anything else.

     Python can be easy to pick up whether you're a first time programmer
     ---------------
     These are some of the reasons people who use Python would rather not use anything else.

     Python can be easy to pick up whether you're a first time programmer
     or you're experienced with other languages.
     The following pages are a useful first step to get on your way
     writing programs with Python!
     ---------------
     or you're experienced with other languages.
     The following pages are a useful first step to get on your way
     writing programs with Python!

     The community hosts conferences and meetups, collaborates on code,
     and much more. Python's documentation will help you along the way,
     ---------------
     The community hosts conferences and meetups, collaborates on code,
     and much more. Python's documentation will help you along the way,
     and the mailing lists will keep you in touch.

     Conferences and Workshops
     Python Documentation
     ---------------
     #+end_example

     其中 collections.deque 是一个双端队列.
     我们在写查询元素的代码时，通常会使用包含 yield 表达式的生成器函数，也就是我们上面代码示例。这样可以将搜索过程和使用搜索代码解耦。
     使用 deque(maxlen=N)构造函数会新建一个固定大小的队列，当新的元素加入并且这个队列已满的时候，最老的元素会自动被移除。
     #+BEGIN_SRC python :exports both :results output
       from collections import deque
       q = deque(maxlen=3)
       q.append(1)
       q.append(2)
       q.append(3)
       print(q)
       q.append(4)
       print(q)
       q.append(5)
       print(q, end='')
     #+END_SRC

     #+RESULTS:
     : deque([1, 2, 3], maxlen=3)
     : deque([2, 3, 4], maxlen=3)
     : deque([3, 4, 5], maxlen=3)
     使用 deque 队列方案会更优雅且运行更快。一般 deque 类可以被用在任何你只需要一个简单队列数据结构的场合。如果你不设置最大队列大小，那么就会得到一个无线大小队列，你可以在队列的两端执行添加和弹出元素的操作，其具体包含那么方法如下：
     #+BEGIN_SRC python :exports both :results output
       from collections import deque

       q = deque(maxlen=20)
       # 尾部添加数据
       q.append(1)
       q.append(2)
       print(q)
       # 头部添加数据
       q.appendleft(3)
       print(q)
       # 尾部扩展可迭代对象
       q.extend([4, 5])
       print(q)
       q.extend(range(3))
       print(q)
       # 头部扩展可迭代对象
       q.extendleft([6, 7])
       print(q)
       # 尾部移除
       q.pop()
       print(q)
       # 头部移除
       q.popleft()
       print(q)
       # 统计元素出现的个数
       print(q.count(1))
       # index 检索
       print(q.index(2))
       # 指定位置插入
       q.insert(13, 56)
       print(q, end='')
       # clear 清空队列
       # copy 复制队列
       # remove 移除队列中指定值
       # reverse 翻转队列
       # rotate 旋转队列
     #+END_SRC

     #+RESULTS:
     #+begin_example
     deque([1, 2], maxlen=20)
     deque([3, 1, 2], maxlen=20)
     deque([3, 1, 2, 4, 5], maxlen=20)
     deque([3, 1, 2, 4, 5, 0, 1, 2], maxlen=20)
     deque([7, 6, 3, 1, 2, 4, 5, 0, 1, 2], maxlen=20)
     deque([7, 6, 3, 1, 2, 4, 5, 0, 1], maxlen=20)
     deque([6, 3, 1, 2, 4, 5, 0, 1], maxlen=20)
     2
     3
     deque([6, 3, 1, 2, 4, 5, 0, 1, 56], maxlen=20)
     #+end_example

