python3_cookbook.html

<div id="outline-container-orgf1492d8" class="outline-3">
<h3 id="orgf1492d8">保留组后 N 个元素</h3>
<div class="outline-text-3" id="text-orgf1492d8">
<p>
在迭代操作或者其他操作时，怎样只保留最后有限几个元素的历史记录？保留有限历史记录正是 collections.deque 大显身手的时候。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> collections <span style="color: #4f97d7; font-weight: bold;">import</span> deque


<span style="color: #7590db;">file_lines</span> = <span style="color: #2d9574;">'''Python is powerful... and fast;</span>
<span style="color: #2d9574;">plays well with others;</span>
<span style="color: #2d9574;">runs everywhere;</span>
<span style="color: #2d9574;">is friendly &amp; easy to learn;</span>
<span style="color: #2d9574;">is Open.</span>
<span style="color: #2d9574;">These are some of the reasons people who use Python would rather not use anything else.</span>

<span style="color: #2d9574;">Python can be easy to pick up whether you're a first time programmer</span>
<span style="color: #2d9574;">or you're experienced with other languages.</span>
<span style="color: #2d9574;">The following pages are a useful first step to get on your way</span>
<span style="color: #2d9574;">writing programs with Python!</span>

<span style="color: #2d9574;">The community hosts conferences and meetups, collaborates on code,</span>
<span style="color: #2d9574;">and much more. Python's documentation will help you along the way,</span>
<span style="color: #2d9574;">and the mailing lists will keep you in touch.</span>

<span style="color: #2d9574;">Conferences and Workshops</span>
<span style="color: #2d9574;">Python Documentation</span>
<span style="color: #2d9574;">Mailing Lists and IRC channels'''</span>


<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">search</span><span style="color: #4f97d7;">(</span>lines, pattern, history=<span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>:
    <span style="color: #7590db;">previous_lines</span> = deque<span style="color: #4f97d7;">(</span>maxlen=history<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">for</span> line <span style="color: #4f97d7; font-weight: bold;">in</span> lines:
        <span style="color: #4f97d7; font-weight: bold;">if</span> pattern <span style="color: #4f97d7; font-weight: bold;">in</span> line:
            <span style="color: #4f97d7; font-weight: bold;">yield</span> line, previous_lines
        previous_lines.append<span style="color: #4f97d7;">(</span>line<span style="color: #4f97d7;">)</span>


<span style="color: #4f97d7; font-weight: bold;">for</span> line, prevlines <span style="color: #4f97d7; font-weight: bold;">in</span> search<span style="color: #4f97d7;">(</span>file_lines.split<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'\n'</span><span style="color: #bc6ec5;">)</span>, <span style="color: #2d9574;">'Python'</span>, <span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">for</span> pline <span style="color: #4f97d7; font-weight: bold;">in</span> prevlines:
        <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>pline<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>line<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'-'</span> * <span style="color: #a45bad;">15</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
Python is powerful... and fast;
---------------
Python is powerful... and fast;
plays well with others;
runs everywhere;
is friendly &amp; easy to learn;
is Open.
These are some of the reasons people who use Python would rather not use anything else.
---------------
runs everywhere;
is friendly &amp; easy to learn;
is Open.
These are some of the reasons people who use Python would rather not use anything else.

Python can be easy to pick up whether you're a first time programmer
---------------
These are some of the reasons people who use Python would rather not use anything else.

Python can be easy to pick up whether you're a first time programmer
or you're experienced with other languages.
The following pages are a useful first step to get on your way
writing programs with Python!
---------------
or you're experienced with other languages.
The following pages are a useful first step to get on your way
writing programs with Python!

The community hosts conferences and meetups, collaborates on code,
and much more. Python's documentation will help you along the way,
---------------
The community hosts conferences and meetups, collaborates on code,
and much more. Python's documentation will help you along the way,
and the mailing lists will keep you in touch.

Conferences and Workshops
Python Documentation
---------------
</pre>

<p>
其中 collections.deque 是一个双端队列.
我们在写查询元素的代码时，通常会使用包含 yield 表达式的生成器函数，也就是我们上面代码示例。这样可以将搜索过程和使用搜索代码解耦。使用 deque(maxlen=N)构造函数会新建一个固定大小的队列，当新的元素加入并且这个队列已满的时候，最老的元素会自动被移除。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> collections <span style="color: #4f97d7; font-weight: bold;">import</span> deque
<span style="color: #7590db;">q</span> = deque<span style="color: #4f97d7;">(</span>maxlen=<span style="color: #a45bad;">3</span><span style="color: #4f97d7;">)</span>
q.append<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
q.append<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
q.append<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">3</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q<span style="color: #4f97d7;">)</span>
q.append<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">4</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q<span style="color: #4f97d7;">)</span>
q.append<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q, end=<span style="color: #2d9574;">''</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
deque([1, 2, 3], maxlen=3)
deque([2, 3, 4], maxlen=3)
deque([3, 4, 5], maxlen=3)

</pre>
<p>
使用 deque 队列方案会更优雅且运行更快。一般 deque 类可以被用在任何你只需要一个简单队列数据结构的场合。如果你不设置最大队列大小，那么就会得到一个无线大小队列，你可以在队列的两端执行添加和弹出元素的操作，其具体包含那么方法如下：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> collections <span style="color: #4f97d7; font-weight: bold;">import</span> deque

<span style="color: #7590db;">q</span> = deque<span style="color: #4f97d7;">(</span>maxlen=<span style="color: #a45bad;">20</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23614;&#37096;&#28155;&#21152;&#25968;&#25454;</span>
q.append<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
q.append<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q<span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22836;&#37096;&#28155;&#21152;&#25968;&#25454;</span>
q.appendleft<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">3</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q<span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23614;&#37096;&#25193;&#23637;&#21487;&#36845;&#20195;&#23545;&#35937;</span>
q.extend<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q<span style="color: #4f97d7;">)</span>
q.extend<span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">range</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q<span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22836;&#37096;&#25193;&#23637;&#21487;&#36845;&#20195;&#23545;&#35937;</span>
q.extendleft<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">6</span>, <span style="color: #a45bad;">7</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q<span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23614;&#37096;&#31227;&#38500;</span>
q.pop<span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q<span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22836;&#37096;&#31227;&#38500;</span>
q.popleft<span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q<span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#32479;&#35745;&#20803;&#32032;&#20986;&#29616;&#30340;&#20010;&#25968;</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q.count<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">index &#26816;&#32034;</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q.index<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25351;&#23450;&#20301;&#32622;&#25554;&#20837;</span>
q.insert<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">13</span>, <span style="color: #a45bad;">56</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q, end=<span style="color: #2d9574;">''</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">clear &#28165;&#31354;&#38431;&#21015;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">copy &#22797;&#21046;&#38431;&#21015;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">remove &#31227;&#38500;&#38431;&#21015;&#20013;&#25351;&#23450;&#20540;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">reverse &#32763;&#36716;&#38431;&#21015;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">rotate &#26059;&#36716;&#38431;&#21015;</span>
</pre>
</div>

<pre class="example">
deque([1, 2], maxlen=20)
deque([3, 1, 2], maxlen=20)
deque([3, 1, 2, 4, 5], maxlen=20)
deque([3, 1, 2, 4, 5, 0, 1, 2], maxlen=20)
deque([7, 6, 3, 1, 2, 4, 5, 0, 1, 2], maxlen=20)
deque([7, 6, 3, 1, 2, 4, 5, 0, 1], maxlen=20)
deque([6, 3, 1, 2, 4, 5, 0, 1], maxlen=20)
2
3
deque([6, 3, 1, 2, 4, 5, 0, 1, 56], maxlen=20)
</pre>
</div>
</div>
