org/python3_cookbook.org
**** 查找最大或最小的 N 个元素
     如何从一个集合中获得最大或最小 N 个元素列表？
     heapq 模块有两个函数：nlargest()和 nsmallest()可以完美解决这两个问题。
     #+BEGIN_SRC python :exports both :results output
       import heapq

       nums = [1, 8, 2, 23, 7, -4, 18, 23, 42, 37, 2]
       print(heapq.nlargest(3, nums))
       print(heapq.nsmallest(3, nums))
     #+END_SRC

     #+RESULTS:
     : [42, 37, 23]
     : [-4, 1, 2]
     两个函数都能接受一个关键字参数，用于复杂的数据结构中：
     #+BEGIN_SRC python :exports both :results output
       import heapq
       from pprint import pprint

       portfolio = [{
           'name': 'IBM',
           'shares': 100,
           'price': 91.1
       }, {
           'name': 'AAPL',
           'shares': 50,
           'price': 543.22
       }, {
           'name': 'FB',
           'shares': 200,
           'price': 21.09
       }, {
           'name': 'HPQ',
           'shares': 35,
           'price': 31.75
       }, {
           'name': 'YHOO',
           'shares': 45,
           'price': 16.35
       }, {
           'name': 'ACME',
           'shares': 75,
           'price': 115.65
       }]

       cheap = heapq.nsmallest(3, portfolio, key=lambda x: x['price'])
       expensive = heapq.nlargest(3, portfolio, key=lambda x: x['price'])
       pprint(cheap)
       pprint(expensive)
     #+END_SRC

     #+RESULTS:
     : [{'name': 'YHOO', 'price': 16.35, 'shares': 45},
     :  {'name': 'FB', 'price': 21.09, 'shares': 200},
     :  {'name': 'HPQ', 'price': 31.75, 'shares': 35}]
     : [{'name': 'AAPL', 'price': 543.22, 'shares': 50},
     :  {'name': 'ACME', 'price': 115.65, 'shares': 75},
     :  {'name': 'IBM', 'price': 91.1, 'shares': 100}]
     key 的排序可以参考 sorted 函数的 key，都是可以采用匿名函数进行复杂排序的。

     如果你想在一个集合中查找最小或最大 N 个元素，并且 N 小于集合元素数量，那么这些函数提供了很好的性能。因为在底层实现里面，首先会先将集合数据进行堆排序后放入一个列表中：
     #+BEGIN_SRC python :exports both :results output
       import heapq

       nums = [1, 8, 2, 23, 7, -4, 18, 23, 42, 37, 2]
       heapq.heapify(nums)
       print(nums)
       print(heapq.heappop(nums))
       print(heapq.heappop(nums))
       uprint(heapq.heappop(nums))
     #+END_SRC

     #+RESULTS:
     : [-4, 2, 1, 23, 7, 2, 18, 23, 42, 37, 8]
     : -4
     : 1
     : 2
     堆数据结构最重要的特征是 heap[0]永远是最小的元素。并且剩余的元素都可以很容易通过调用 heapq.heappop()方法得到，该方法会先将地一个元素弹出，然后用下一个最小元素来取代被弹出的元素（这种操作时间复杂度仅仅是 O(logN)，N 是堆大小）。
     堆数据结构的实现是一个很有趣并且值得深入学习的东西，基本上只要是数据结构和算法书籍里都会提到。heapq 模块官方提供了详细的堆数据结构底层实现细节，可以参考研究一下。对于提高 python 是很有帮助的。
    
