python3_cookbook.html

<div id="outline-container-orga3f30cb" class="outline-3">
<h3 id="orga3f30cb">查找最大或最小的 N 个元素</h3>
<div class="outline-text-3" id="text-orga3f30cb">
<p>
如何从一个集合中获得最大或最小 N 个元素列表？
heapq 模块有两个函数：nlargest()和 nsmallest()可以完美解决这两个问题。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> heapq

<span style="color: #7590db;">nums</span> = <span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">8</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">23</span>, <span style="color: #a45bad;">7</span>, -<span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">18</span>, <span style="color: #a45bad;">23</span>, <span style="color: #a45bad;">42</span>, <span style="color: #a45bad;">37</span>, <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">]</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>heapq.nlargest<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">3</span>, nums<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>heapq.nsmallest<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">3</span>, nums<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
[42, 37, 23]
[-4, 1, 2]

</pre>
<p>
两个函数都能接受一个关键字参数，用于复杂的数据结构中：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> heapq
<span style="color: #4f97d7; font-weight: bold;">from</span> pprint <span style="color: #4f97d7; font-weight: bold;">import</span> pprint

<span style="color: #7590db;">portfolio</span> = <span style="color: #4f97d7;">[</span><span style="color: #bc6ec5;">{</span>
    <span style="color: #2d9574;">'name'</span>: <span style="color: #2d9574;">'IBM'</span>,
    <span style="color: #2d9574;">'shares'</span>: <span style="color: #a45bad;">100</span>,
    <span style="color: #2d9574;">'price'</span>: <span style="color: #a45bad;">91</span>.<span style="color: #a45bad;">1</span>
<span style="color: #bc6ec5;">}</span>, <span style="color: #bc6ec5;">{</span>
    <span style="color: #2d9574;">'name'</span>: <span style="color: #2d9574;">'AAPL'</span>,
    <span style="color: #2d9574;">'shares'</span>: <span style="color: #a45bad;">50</span>,
    <span style="color: #2d9574;">'price'</span>: <span style="color: #a45bad;">543</span>.<span style="color: #a45bad;">22</span>
<span style="color: #bc6ec5;">}</span>, <span style="color: #bc6ec5;">{</span>
    <span style="color: #2d9574;">'name'</span>: <span style="color: #2d9574;">'FB'</span>,
    <span style="color: #2d9574;">'shares'</span>: <span style="color: #a45bad;">200</span>,
    <span style="color: #2d9574;">'price'</span>: <span style="color: #a45bad;">21</span>.<span style="color: #a45bad;">09</span>
<span style="color: #bc6ec5;">}</span>, <span style="color: #bc6ec5;">{</span>
    <span style="color: #2d9574;">'name'</span>: <span style="color: #2d9574;">'HPQ'</span>,
    <span style="color: #2d9574;">'shares'</span>: <span style="color: #a45bad;">35</span>,
    <span style="color: #2d9574;">'price'</span>: <span style="color: #a45bad;">31</span>.<span style="color: #a45bad;">75</span>
<span style="color: #bc6ec5;">}</span>, <span style="color: #bc6ec5;">{</span>
    <span style="color: #2d9574;">'name'</span>: <span style="color: #2d9574;">'YHOO'</span>,
    <span style="color: #2d9574;">'shares'</span>: <span style="color: #a45bad;">45</span>,
    <span style="color: #2d9574;">'price'</span>: <span style="color: #a45bad;">16</span>.<span style="color: #a45bad;">35</span>
<span style="color: #bc6ec5;">}</span>, <span style="color: #bc6ec5;">{</span>
    <span style="color: #2d9574;">'name'</span>: <span style="color: #2d9574;">'ACME'</span>,
    <span style="color: #2d9574;">'shares'</span>: <span style="color: #a45bad;">75</span>,
    <span style="color: #2d9574;">'price'</span>: <span style="color: #a45bad;">115</span>.<span style="color: #a45bad;">65</span>
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">]</span>

<span style="color: #7590db;">cheap</span> = heapq.nsmallest<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">3</span>, portfolio, key=<span style="color: #4f97d7; font-weight: bold;">lambda</span> x: x<span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">'price'</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">expensive</span> = heapq.nlargest<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">3</span>, portfolio, key=<span style="color: #4f97d7; font-weight: bold;">lambda</span> x: x<span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">'price'</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
pprint<span style="color: #4f97d7;">(</span>cheap<span style="color: #4f97d7;">)</span>
pprint<span style="color: #4f97d7;">(</span>expensive<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
[{'name': 'YHOO', 'price': 16.35, 'shares': 45},
 {'name': 'FB', 'price': 21.09, 'shares': 200},
 {'name': 'HPQ', 'price': 31.75, 'shares': 35}]
[{'name': 'AAPL', 'price': 543.22, 'shares': 50},
 {'name': 'ACME', 'price': 115.65, 'shares': 75},
 {'name': 'IBM', 'price': 91.1, 'shares': 100}]

</pre>
<p>
key 的排序可以参考 sorted 函数的 key，都是可以采用匿名函数进行复杂排序的。
</p>

<p>
如果你想在一个集合中查找最小或最大 N 个元素，并且 N 小于集合元素数量，那么这些函数提供了很好的性能。因为在底层实现里面，首先会先将集合数据进行堆排序后放入一个列表中：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> heapq

<span style="color: #7590db;">nums</span> = <span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">8</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">23</span>, <span style="color: #a45bad;">7</span>, -<span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">18</span>, <span style="color: #a45bad;">23</span>, <span style="color: #a45bad;">42</span>, <span style="color: #a45bad;">37</span>, <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">]</span>
heapq.heapify<span style="color: #4f97d7;">(</span>nums<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>nums<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>heapq.heappop<span style="color: #bc6ec5;">(</span>nums<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>heapq.heappop<span style="color: #bc6ec5;">(</span>nums<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
uprint<span style="color: #4f97d7;">(</span>heapq.heappop<span style="color: #bc6ec5;">(</span>nums<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
堆数据结构最重要的特征是 heap[0]永远是最小的元素。并且剩余的元素都可以很容易通过调用 heapq.heappop()方法得到，该方法会先将地一个元素弹出，然后用下一个最小元素来取代被弹出的元素（这种操作时间复杂度仅仅是 O(logN)，N 是堆大小）。堆数据结构的实现是一个很有趣并且值得深入学习的东西，基本上只要是数据结构和算法书籍里都会提到。heapq 模块官方提供了详细的堆数据结构底层实现细节，可以参考研究一下。对于提高 python 是很有帮助的。
</p>
</div>
</div>
