org/python3_cookbook.org
**** 实现一个优先级队列
     怎样实现一个按优先级排序的队列？并且在这个队列上每次 pop 操作总是返回优先级最高的那个元素？
     一下是利用 heapq 模块实现了一个简单的优先级队列：
     #+BEGIN_SRC python :exports both :results output
       import heapq


       class PriorityQueue(object):
           def __init__(self):
               self._queue = []
               self._index = 0

           def push(self, item, priority):
               heapq.heappush(self._queue, (-priority, self._index, item))
               self._index += 1

           def pop(self):
               return heapq.heappop(self._queue)[-1]


       class Item(object):
           def __init__(self, name):
               self.name = name

           def __repr__(self):
               return 'Item({!r})'.format(self.name)


       q = PriorityQueue()
       q.push(Item('foo'), 1)
       q.push(Item('bar'), 5)
       q.push(Item('spam'), 4)
       q.push(Item('grok'), 1)
       for _ in range(4):
           print(q.pop())
     #+END_SRC

     #+RESULTS:
     : Item('bar')
     : Item('spam')
     : Item('foo')
     : Item('grok')
     第一个 pop()操作返回优先级最高的元素。另外注意到如果两个有着相同优先级的元素(foo 和 grok），pop 操作按照它们传入到队列的顺序返回。
     这一节主要关注 heapq 模块。
*** 字符串和文本 
    
*** 数字日期和时间

*** 迭代器与生成器

*** 文本与 IO
*** 数据编码和处理

*** 函数

*** 类与对象

*** 元编程

*** 模块与包

*** 网络与 web 编程

*** 并发编程

*** 脚本编程与系统管理

*** 测试、调试和异常

*** C 语言扩展
