python3_cookbook.html

<div id="outline-container-org209ca5a" class="outline-3">
<h3 id="org209ca5a">实现一个优先级队列</h3>
<div class="outline-text-3" id="text-org209ca5a">
<p>
怎样实现一个按优先级排序的队列？并且在这个队列上每次 pop 操作总是返回优先级最高的那个元素？一下是利用 heapq 模块实现了一个简单的优先级队列：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> heapq


<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">PriorityQueue</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">object</span><span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">self</span>._queue = <span style="color: #4f97d7;">[]</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>._index = <span style="color: #a45bad;">0</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">push</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, item, priority<span style="color: #4f97d7;">)</span>:
        heapq.heappush<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>._queue, <span style="color: #bc6ec5;">(</span>-priority, <span style="color: #4f97d7; font-weight: bold;">self</span>._index, item<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>._index += <span style="color: #a45bad;">1</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">pop</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">return</span> heapq.heappop<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>._queue<span style="color: #4f97d7;">)[</span>-<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">]</span>


<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Item</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">object</span><span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, name<span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">self</span>.name = name

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__repr__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #2d9574;">'Item({!r})'</span>.<span style="color: #4f97d7;">format</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>.name<span style="color: #4f97d7;">)</span>


<span style="color: #7590db;">q</span> = PriorityQueue<span style="color: #4f97d7;">()</span>
q.push<span style="color: #4f97d7;">(</span>Item<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'foo'</span><span style="color: #bc6ec5;">)</span>, <span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
q.push<span style="color: #4f97d7;">(</span>Item<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'bar'</span><span style="color: #bc6ec5;">)</span>, <span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>
q.push<span style="color: #4f97d7;">(</span>Item<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'spam'</span><span style="color: #bc6ec5;">)</span>, <span style="color: #a45bad;">4</span><span style="color: #4f97d7;">)</span>
q.push<span style="color: #4f97d7;">(</span>Item<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'grok'</span><span style="color: #bc6ec5;">)</span>, <span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">for</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">4</span><span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>q.pop<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
Item('bar')
Item('spam')
Item('foo')
Item('grok')

</pre>
<p>
第一个 pop()操作返回优先级最高的元素。另外注意到如果两个有着相同优先级的元素(foo 和 grok），pop 操作按照它们传入到队列的顺序返回。这一节主要关注 heapq 模块。
</p>
</div>
</div>
</div>
<div id="outline-container-org900e24c" class="outline-2">
<h2 id="org900e24c">字符串和文本</h2>
</div>

<div id="outline-container-org984de2b" class="outline-2">
<h2 id="org984de2b">数字日期和时间</h2>
</div>

<div id="outline-container-orgef8a60d" class="outline-2">
<h2 id="orgef8a60d">迭代器与生成器</h2>
</div>

<div id="outline-container-orge222deb" class="outline-2">
<h2 id="orge222deb">文本与 IO</h2>
</div>
<div id="outline-container-org3dc8150" class="outline-2">
<h2 id="org3dc8150">数据编码和处理</h2>
</div>

<div id="outline-container-org0b6d568" class="outline-2">
<h2 id="org0b6d568">函数</h2>
</div>

<div id="outline-container-org5377ac1" class="outline-2">
<h2 id="org5377ac1">类与对象</h2>
</div>

<div id="outline-container-orgb2c42f9" class="outline-2">
<h2 id="orgb2c42f9">元编程</h2>
</div>

<div id="outline-container-org013f137" class="outline-2">
<h2 id="org013f137">模块与包</h2>
</div>

<div id="outline-container-org15592bd" class="outline-2">
<h2 id="org15592bd">网络与 web 编程</h2>
</div>

<div id="outline-container-org6f1a438" class="outline-2">
<h2 id="org6f1a438">并发编程</h2>
</div>

<div id="outline-container-org7f086ae" class="outline-2">
<h2 id="org7f086ae">脚本编程与系统管理</h2>
</div>

<div id="outline-container-org59d38d5" class="outline-2">
<h2 id="org59d38d5">测试、调试和异常</h2>
</div>

<div id="outline-container-orgcaff163" class="outline-2">
<h2 id="orgcaff163">C 语言扩展</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-12-14 四 18:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
